const planets = ['Earth', 'Mars', 'Venus']

// виводимо елементи масиву
console.log(planets);
// виводимо табличку з індексами та елементами масиву - так зручніше розбиратися з масивом
console.table(planets);

// Задача 1. Порахувати загальну суму покупок у корзині

const cart = [54, 28, 105, 70, 92, 17, 120];

// Крок 2. Зробити змінну total, де будемо зберігати загальну суму. 
// Важливо! Цю перемінну треба створити до циклу, щоб вона була в глобальній області видимості.
let total = 0;

// Крок 1. Перебрати масив.
/* for (let i = 0; i < cart.length; i += 1) {
    console.log(cart[i]);

    // Крок 3. Кожен елемент додати до total.
    total += cart[i];
    // total = total + cart[i] - розшифровка запису попереднього рядка
} */

// Але вийшло багато синтаксису. Якщо нам не треба змінювати значення змінної, то варто скоротити запис.

for (const value of cart) {
    total += value; 
}

console.log('Total: ', total);

/* // Додати податок кожному працівнику, тобто ідеться про зміну елементу, відповідно, потрібен цикл for

for (let i = 0; i < cart.length; i += 1) {
    cart[i] = Math.round(cart[i] * 1.1);
}

console.log(cart); */
